Конфигурация/src/Documents/ОплатаЗаказа/ОплатаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЗаказа</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ОплатаЗаказа/Forms/ФормаДокументаОплатыЗаказов/Module.bsl
// @strict-types

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)

	Заказ = Объект.Заказ;
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		
		ДанныеЗаказа = ПолучитьДанныеЗаказа(Заказ);
		Объект.Курьер = ДанныеЗаказа.Курьер;
		Объект.СуммаЗаказа = ДанныеЗаказа.СуммаЗаказа;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить данные заказа.
// 
// Параметры:
//  СсылкаЗаказ - ДокументСсылка.Заказ
// 
// Возвращаемое значение:
//  Структура - Получить данные заказа:
// * Курьер - СправочникСсылка.Курьеры - 
// * СуммаЗаказа - Число - 
&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказа(СсылкаЗаказ)
	
	Результат = Новый Структура("Курьер, СуммаЗаказа", Справочники.Курьеры.ПустаяСсылка(), 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказ.Курьер КАК Курьер,
		|	Заказ.СуммаЗаказа КАК СуммаЗаказа
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

		Результат.Курьер = Выборка.Курьер;
		Результат.СуммаЗаказа = Выборка.СуммаЗаказа;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
